Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །ཡུན་རིང་པོ་ནས་ཟས་ཀྱི་ཚོད་ཤེས་པ་དང་ཉུང་ངུ་ཟ་བ་དང་། ལྟོ་སྡོམ་པ་དང་། ནད་པ་ལ་སྨན་སྦྱིན་པ་དང་། སྐྱེ་བོ་དམན་པ་ལ་མི་བརྙས་པ་དང་། མགོན་མེད་པ་ཁྱད་དུ་མི་གསོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ཞིག་པ་འཆོས་པ་དང་། མཆོད་རྟེན་རྩིག་པ་དང་། འཇིགས་པས་ཉེན་པའི་སེམས་ཅན་རྣམས་ལ་མི་འཇིགས་པ་སྦྱིན་པའི་ཕྱིར་ཤིང་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པ་ཞེས་བྱའོ།
en: “For so long he has known the right measure in eating and has only eaten a little in a restricted manner. He has given medicine to those weakened by the travails of self-control, never despised the poor or the base, never oppressed those who are without protector, repaired the broken memorials of the thus-gone ones, built memorials, and removed fear from those plagued by anxiety. Therefore he is the One with Proportions of a Perfect Circle like the Nyagrodha Tree.

source: །ཡུན་རིང་པོ་ནས་ཕ་མ་དང་། བྲམ་ཟེ་དང་། དགེ་སྦྱོང་དང་། བླ་མ་དང་། སྦྱིན་གནས་རྣམས་ལ་བཀྲུ་བ་དང་། བསྐུ་བ་དང་། མར་དང་། འབྲུ་མར་གྱིས་སྐུད་པ་དང་། གྲང་བའི་དུས་ན་ནི་ཆུ་དྲོན་པོ་དང་ཚ་བའི་དུས་ན་ནི་ཆུ་གྲང་བ་དང་། བསིལ་གྲིབ་དང་དུས་ཀྱི་བདེ་བའི་ལོངས་སྤྱོད་སྦྱིན་པ་དང་། ཤིང་བལ་འཇམ་པོ་ལྟར་རེག་ན་བདེ་ཞིང་འཇམ་པའི་རས་ལེགས་པར་བཏིང་བའི་མལ་ཆ་སྦྱིན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་སྤོས་ཀྱི་འབྲུ་མར་འཐོར་བ་དང་། དར་ཕྲ་མོའི་རྒྱལ་མཚན་དང་། བ་དན་དང་། སྲད་བུ་འབུལ་བའི་ཕྱིར་སྐུའི་པགས་པ་འཇམ་ཞིང་མཉེན་ལ་སྲབ་པ་ཞེས་བྱའོ།
en: “For so long he has served parents, priests, monks, spiritual teachers, and worthy ones by washing them, anointing them, and massaging them with oils. When it was cold he has used hot water in the sun, and when it was hot he has used cool water in the shade, offering them comforts depending on the season of the year. He has given them beds and seats covered with soft and pleasant cloth, and to the memorials of the thus-gone ones he has offered fragrant oils, banners of delicate cloth, flags, and threads of silk. Therefore he is the One with Smooth and Fine Skin.

source: །ཡུན་རིང་པོ་ནས་སེམས་ཅན་ལ་ཁོང་ཁྲོ་བ་མེད་པ་དང་། བྱམས་པ་བསྒོམས་པ་ལ་སྦྱོར་བ་དང་། བཟོད་པ་དང་དེས་པ་ལ་སེམས་ཅན་གཞན་དག་འཛུད་པ་དང་། ཁོན་དུ་འཛིན་པ་མེད་ཅིང་གནོད་སེམས་མེད་པའི་ཡོན་ཏན་གྱི་བསྔགས་པ་བརྗོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་རྣམས་ལ་གསེར་གྱི་རྒྱན་དང་། གསེར་གྱི་མེ་ཏོག་དང་། གསེར་གྱི་ཕྱེ་མ་འཐོར་བ་དང་། གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་དར་གྱི་བ་དན་དང་། རྒྱལ་མཚན་དང་། རྒྱན་དང་། གསེར་གྱི་སྣོད་དང་། གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་གོས་འབུལ་བའི་ཕྱིར།
en: “For so long he has never rejected any sentient being, and instead he has delighted in practicing love and patience while inspiring others to do the same by praising the good qualities of forgiveness and altruism. To the memorials of the thus-gone ones and the statues of the thus-gone ones, he has offered golden ornaments, golden flowers, gold dust, and silken banners in golden color. He has also offered ornaments, golden vessels, and golden-colored garments.

source: པགས་པའི་མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་ཞེས་བྱའོ།
en: Therefore he is the One with Skin like Gold.

source: །ཡུན་རིང་པོ་ནས་མཁས་པའི་གན་དུ་འགྲོ་ཞིང་དགེ་བ་དང་མི་དགེ་བ་གང་ཡིན་ཞེས་འདྲི་བ་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། བསྟེན་པར་བྱ་བ་དང་། བསྟེན་པར་བྱ་བ་མ་ཡིན་པ་དང་། །ངན་པ་དང་། འབྲིང་དང་། གྱ་ནོམ་པའི་ཆོས་ཡོངས་སུ་འདྲི་བ་དང་། དེའི་དོན་དཔྱད་པ་དང་། ཡོངས་སུ་འཇལ་བ་ལ་རྨོངས་པ་མེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་སྲིན་བུ་ཀི་ཏ་དང་། ལུ་ཏའི་ཚད་དང་། བ་རྒྱ་དང་། མེ་ཏོག་རྙིང་པ་དང་། རྩྭ་སྣ་ཚོགས་དང་། ཕྱག་དར་ཡོད་པ་སེལ་བར་སྦྱོར་བའི་ཕྱིར་སྤུ་རེ་རེ་ནས་སྐྱེས་པ་ཞེས་བྱའོ།
en: “For so long he has attended scholars and clarified what is virtuous and what is not. He has inquired about what is objectionable and what is not, what is to be practiced and what is not, which dharmas are bad, which mediocre, and which sublime. He has examined the meaning, evaluated it, and gained full certainty. He has cleaned away the insects, spider webs, faded flowers, various weeds, and sand from the memorials of the thus-gone ones. Therefore he is the One with Untangled Hair.

source: །ཡུན་རིང་པོ་ནས་ཕ་མ་དང་། གཙོ་བོ་དང་། དམ་པ་དང་། མཆོད་པའི་འོས་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། ཕོངས་པ་དང་། སློང་བ་ལ་སྩོགས་པ་འོངས་པ་དག་ལ་བསྟི་སྟང་དུ་བྱས་ཏེ། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཟས་དང་། སྐོམ་དང་། མལ་ཆ་དང་། སྨན་དང་། གོས་དང་། གནས་དང་། མར་མེ་དང་། འཚོ་བའི་ཡོ་བྱད་རུང་བ་སྦྱོར་བ་དང་། ཁྲོན་པ་དང་། རྫིང་ཆུ་བསིལ་བས་གང་བ་དག །སྐྱེ་བོ་མང་པོའི་ལོངས་སྤྱོད་དུ་སྦྱིན་པའི་ཕྱིར་བདུན་མཐོ་བ་ཞེས་བྱའོ།
en: “For so long he has showed respect to parents, leaders, elders, holy people, monks, priests, beggars, destitute beings, and many others who have come to him, satisfying their wishes by providing them with food, drinks, bedding, medicine, clothes, homes, lamps, and all the manufactured necessities of life, plus wells and lotus ponds filled with cool water. Therefore he is the One with the Seven Protuberances.

source: །ཡུན་རིང་པོ་ནས་ཕ་མ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། བླ་མ་དང་། སྦྱིན་གནས་ལ་འདུད་པ་དང་། རབ་ཏུ་འདུད་པ་དང་། གསོང་པོར་སྨྲ་བ་དང་། མི་འཇིགས་པ་སྦྱིན་པ་དང་། ཉམ་ཆུང་བ་ལ་མི་བརྙས་པ་དང་། སྐྱབས་སུ་སོང་བ་ཡོངས་སུ་མི་གཏོང་བ་བརྟན་པོར་ཡང་དག་པར་བླངས་པ་ཡོངས་སུ་མི་གཏོང་བའི་ཕྱིར།
en: “For so long he has showed respect to parents, monks, priests, spiritual teachers, and worthy ones, addressing them while bowing or prostrating, and protecting them from danger. He has never shown disrespect to the weak, and never forsaken those seeking refuge. He has never abandoned his firm resolve.

source: རོ་སྟོད་སེང་གེ་འདྲ་བ་ཞེས་བྱའོ།
en: For this reason he is known as the One with the Torso like a Lion.

source: །ཡུན་རིང་པོ་ནས་རང་གི་ཉེས་པ་ལ་ཡོངས་སུ་འཇལ་བ་དང་། གཞན་གྱི་འཁྲུལ་པ་དང་། གཞན་གྱི་སྐྱོན་ལ་ཉེས་པར་མི་ལྟ་བ་དང་། རྩོད་པའི་རྩ་བ་དང་། གཞན་འབྱེད་པར་བྱེད་པའི་བརྗོད་པ་ཡོངས་སུ་སྤོང་བ་དང་། གསང་ཚིག་ལེགས་པར་འདོར་བ་དང་། ངག་གི་ལས་ཀྱི་མཐའ་ལེགས་པར་བསྲུངས་པའི་ཕྱིར། ཐལ་གོང་རྒྱས་པ་ཞེས་བྱའོ།
en: “For so long he has recognized his own faults and never pointed out the faults of others who have stumbled. He has relinquished the cause of debate and has not engaged in divulging secrets that cause discord among others. In this way he has carefully guarded his speech, actions, and mind, and so he is the One with Broad Shoulders.

source: །ཡུན་རིང་པོ་ནས་ཕ་མ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། བླ་མ་དང་། སྦྱིན་གནས་རྣམས་ལ་ལྡང་བ་དང་། བསུ་བ་དང་། གསོང་པོར་སྨྲ་བ་དང་། བསྟན་བཅོས་ཐམས་ཅད་ལ་འཇིགས་པ་མེད་པས་རྩོད་པར་འདོད་པའི་སེམས་ཅན་ཚར་གཅོད་པ་དང་། རང་གི་ཆོས་འདུལ་བ་དང་འཐུན་པར་ཡང་དག་པར་འཇུག་པ་དང་། རྒྱལ་པོ་དང་བློན་པོ་ལ་སོགས་པ་དགེ་བའི་ལས་ཀྱི་ལམ་ལ་འགོད་པ་དང་། སྒོམ་དུ་འཇུག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཡོངས་སུ་འཛིན་པ་དང་། ཀུན་ཏུ་འཛིན་པ་དང་། དགེ་བའི་སྤྱོད་པ་ཐམས་ཅད་ཡང་དག་པར་འཛིན་དུ་འཇུག་པའི་སྔོན་དུ་འགྲོ་བའི་ཕྱིར།
en: “For so long he has showed respect to parents, monks, priests, spiritual teachers, and worthy ones by rising for them, welcoming them, and addressing them honestly. Because he is an expert in the entire commentarial literature, he has been able to restrain beings in their desire to argue and instead has promoted his own Dharma-precepts in a tactful way. He has established others, such as well-intentioned kings and ministers, on the path of Dharma, which has duly furthered the cause of virtue. In this way he has upheld the totality of the teaching of the Thus-Gone One perfectly and inspired others to practice every virtue.

source: དཔུང་མགོ་ཤིན་ཏུ་ཟླུམ་པ་ཞེས་བྱའོ།
en: For this reason he is the One with Round Shoulders.

source: །ཡུན་རིང་པོ་ནས་སློང་བའི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་། སྙན་པར་སྨྲ་བ་དང་། ལྷགས་པ་རྣམས་ལ་ཡང་མི་བརྙས་ཤིང་སྤ་གོང་བར་མི་བྱེད་པ་དང་། མི་སྐྱོ་བ་དང་། ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར།
en: “For so long he has given up all possessions and addressed beggars by pleasant names, whichever they may like to hear. Whenever they have approached, he has never felt contempt for them, disappointed them, or turned them away.

source: སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ། བརྟན་པོར་ཡང་དག་པར་བླངས་པ་མི་འདོར་བའི་ཕྱིར།
en: Duly fulfilling their wishes, he has never wavered in his firm resolve to give up his wealth.

source: འགྲམ་པ་སེང་གེའི་འདྲ་བ་ཞེས་བྱའོ།
en: For this reason he is known as the One with a Lion’s Jaw.

source: །ཡུན་རིང་པོ་ནས་ཕྲ་མའི་ཚིག་ཡོངས་སུ་སྤོང་བ་དང་། དབྱེན་གྱི་གསང་ཚིག་མི་འཛིན་པ་དང་། འདུམ་པར་བསྡུམས་བྱེད་འདོད་པ་དང་། འདུམ་པ་རྣམས་དབྱེ་བར་མི་སེམས་པ་དང་། ཕྲ་མའི་ཚིག་ལ་སྨོད་པ་དང་། འདུམ་པ་བསྡུམས་པའི་ཡོན་ཏན་གྱི་བསྔགས་པ་བརྗོད་པར་སྦྱོར་བའི་ཕྱིར།
en: “For so long he has totally given up divisive talk and has not accepted advice that might lead to dispute, shining with the complete harmony of concord. He has criticized divisive talk and praised the qualities of getting along in complete harmony.

source: ཚེམས་བཞི་བཅུ་མཉམ་པ་ཞེས་བྱའོ།
en: Therefore he is called the One with Forty Even Teeth.

source: །ཡུན་རིང་པོ་ནས་ནག་པོའི་ཕྱོགས་ཡོངས་སུ་སྤོང་བ་དང་། དཀར་པོའི་ཕྱོགས་དགེ་བའི་རྩ་བ་སོགས་པ་དང་། ལས་གནག་ཅིང་རྣམ་པར་སྨིན་པ་ཡང་གནག་པ་ཡོངས་སུ་སྤོང་བ་དང་། ལས་དཀར་ཞིང་རྣམ་པར་སྨིན་པ་ཡང་དཀར་བ་བསྔགས་པ་དང་། འོ་མ་དང་སྦྱར་བའི་ཟས་དང་། གོས་དཀར་པོ་སྦྱིན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་རྟེན་རྣམས་ལ་རྡོ་ཐལ་འོ་མ་དང་བསྲེས་པ་པིར་གྱིས་སྐུད་པ་དང་། མེ་ཏོག་སུ་མ་ན་དང་། བཱར་ཤི་ཀ་དང་། དྷ་ནུ་སྐ་རིའི་ཕྲེང་བ་བརྒྱུས་པའི་མེ་ཏོག་གི་ཆུན་པོ་དང་། མེ་ཏོག་ཁ་དོག་དཀར་པོ་སྦྱིན་པའི་ཕྱིར།
en: “For so long he has abandoned evil ways and adopted the virtue of goodness. He has avoided bad actions and their maturation, and praised good actions and their maturation. He has made offerings of white cloth and food mixed with milk, and he has painted the memorials of the thus-gone ones with whitewash mixed with milk, while offering them various white flowers and garlands of sumanā, vārṣikī, and dhānuṣkari flowers.

source: ཚེམས་ཤིན་ཏུ་དཀར་བ་ཞེས་བྱའོ།
en: Therefore he is the One with Pure White Teeth.

source: །ཡུན་རིང་པོ་ནས་འཕྱ་བ་དང་། འཐིང་བ་རྣམ་པར་སྤོང་བ་དང་། ཀུན་དགའ་བར་བྱེད་པ་དང་། ཚིག་སྲུང་བ་དང་། ཀུན་དགའ་བར་བྱེད་པའི་ཚིག་བརྗོད་པ་དང་། གཞན་གྱི་འཁྲུལ་པ་དང་། གཞན་གྱི་སྐྱོན་མི་ཚོལ་བ་དང་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་འཐུན་པར་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་། མཉམ་པར་སྦྱོར་བ་དང་། མཉམ་པར་ཆོས་སྟོན་པ་བརྟན་པོར་ཡང་དག་པར་བླངས་པ་ཡོངས་སུ་མི་འདོར་བའི་ཕྱིར།
en: “For so long he has given up laughing at and mocking others. Instead he has made everyone happy, guarded his words, and spoken in a way that has made others happy. Never looking for shortcomings and mistakes in others, he has been striving to make everyone get along. He has never wavered in his firm resolve to teach the same Dharma to everyone.

source: ཚེམས་ཐགས་བཟང་བ་ཞེས་བྱའོ།
en: Therefore he is the One with Teeth without Gap.

source: །ཡུན་རིང་པོ་ནས་སེམས་ཅན་ཐམས་ཅད་ལ་རྣམ་པར་མི་འཚེ་བ་དང་། རྣམ་པར་ཐོ་མི་འཚམ་པ་དང་། ནད་སྣ་ཚོགས་ཀྱིས་ཐེབས་པ་ལ་རིམ་གྲོ་བྱེད་པ་དང་། ནད་པ་ལ་སྨན་བྱིན་པ་དང་། འདྲོན་པ་རྣམས་ལ་རོ་བྲོ་བ་ཐམས་ཅད་སྦྱིན་པས་ཡོངས་སུ་མི་སྐྱོ་བའི་ཕྱིར།
en: “For so long he has never harmed nor hurt anyone. Instead he has nursed those stricken by disease and given medicine to the sick. He has never tired of giving all kinds of elixirs to those who needed them.

source: རོ་བྲོ་བ་མཆོག་དང་ལྡན་པ་ཞེས་བྱའོ།
en: Therefore he is called the Possessor of the Universal Elixir of Elixirs.

source: །ཡུན་རིང་པོ་ནས་བརྫུན་དང་། ཚིག་རྩུབ་པོ་དང་། བརླང་པོ་དང་། གཡོ་དང་། གཞན་ལ་གནོད་པ་དང་། གཞན་འཁྲུག་པར་བྱེད་པ་དང་། མི་སྙན་པ་དང་། གཞན་གྱི་མཚང་འདྲུ་བའི་ཚིག་ཡོངས་སུ་སྤོང་བ་དང་། བྱམས་པ་དང་སྙིང་རྗེ་ལ་སྦྱོར་བ་དང་། དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བར་བྱེད་པ་དང་། འཇམ་པ་དང་། སྙན་པ་དང་། མཉེན་པ་དང་། སྙིང་དུ་འཐད་པ་དང་། སེམས་ཅན་གྱི་དབང་པོ་ཚིམ་པར་བྱེད་པ་དང་། ཡང་དག་པའི་ངག་ལ་ཡང་དག་པར་སྦྱོར་བའི་ཕྱིར། ཚངས་པའི་དབྱངས་ལྟ་བུ་ཞེས་བྱའོ།
en: “For so long he has never lied or spoken harsh words. Nor has he been rude or dishonest, or sought to humiliate others. Nor has he been unpleasant, or attacked others’ weak points. Instead he has practiced love and compassion and applied himself to making others feel happy and fulfilled. With sympathetic joy, he has spoken words that cause happiness—loving, pleasant, and soft words that have touched others, satisfied them, and refreshed their senses. In this way he has applied himself to proper talk and therefore he is the One with the Voice of Brahmā.

source: །ཡུན་རིང་པོ་ནས་ཕ་མ་ལ་བྱ་བ་དང་འདྲ་བར་སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་པའི་མིག་ཏུ་སྦྱོར་བ་དང་། བུ་གཅིག་པ་ལ་བྱ་བ་བཞིན་དུ་སློང་བ་ལ་བྱམས་པ་དང་། སྙིང་རྗེ་སྔོན་དུ་འགྲོ་བས་ལྟ་བ་དང་། སྤ་གོང་བར་མི་བྱེད་པ་དང་། དད་པའི་དབང་པོས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་མིག་མི་འཛུམས་པར་ལྟ་བ་དང་། སེམས་ཅན་གཞན་དེ་བཞིན་གཤེགས་པ་ལ་ལྟ་བ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་བརྟན་པོར་ཡང་དག་པར་བླངས་པའི་ཕྱིར་སྤྱན་མཐོན་ཏིང་དུ་འདུག་པ་ཞེས་བྱའོ།
en: “For so long he has regarded sentient beings, with his unhindered vision, as his mothers, fathers, and children. Looking at beggars as if they were his only children, he has been filled with love and compassion and has never disappointed them. With his senses still, he has looked at the memorials of the thus-gone ones with unblinking eyes. He has made a firm resolve to inspire other beings to meet the Thus-Gone One, and therefore he is the One with Deep Blue Eyes.

source: །ཡུན་རིང་པོ་ནས་བློ་གྲོས་དམན་པ་དང་། སེམས་པ་དམན་པ་རྣམ་པར་སྤོང་བ་དང་། རྒྱ་ཆེན་པོ་དང་། རླབས་པོ་ཆེ་ལ་མོས་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། བླ་ན་མེད་པའི་ཆོས་ལ་མོས་པའི་སེམས་ཅན་ཡང་དག་པར་འཛུད་པ་དང་། ཁྲོ་གཉེར་གྱི་བཞིན་རྣམ་པར་སྤོང་བ་དང་། འཛུམ་པའི་བཞིན་དང་ལྡན་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཀྱི་གན་དུ་འགྲོ་ཞིང་མངོན་དུ་ཕྱོགས་པའི་སྔོན་དུ་འགྲོ་བས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་སོགས་པ་ལས་ཕྱིར་མི་ལྡོག་པའི་ཕྱིར་སྤྱན་གྱི་རྫི་མ་བའི་འདྲ་བ་ཞེས་བྱའོ།
en: “For so long he has given up unintelligent and lowly attitudes and instead has applied himself perfectly to the lofty and vast. He has inspired beings with the feeling of delight for the Dharma. He has never frowned at others but always showed a smiling face. He has sought the presence of all spiritual teachers and, being so predisposed, he has transformed himself into a collection of everything auspicious. Therefore he is said to have eyelashes like a cow.

source: །ཡུན་རིང་པོ་ནས་ཚིག་གི་སྐྱོན་ཐམས་ཅད་རྣམ་པར་སྤོང་བ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། ཆོས་སྨྲ་བ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་གྱི་བསྔགས་པ་ཚད་མེད་པར་བརྗོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མདོ་སྡེ་ཡི་གེར་འདྲི་བ་དང་། ཀློག་པ་དང་། འདོན་པ་དང་། རྣམ་པར་ཤེས་པར་བྱེད་པ་དང་། ཆོས་དེ་དག་གི་དོན་དང་། ཚིག་རབ་ཏུ་དབྱེ་བ་སེམས་ཅན་གཞན་ལ་གོ་བར་བྱེད་པ་ལ་མཁས་པའི་ཕྱིར།
en: “For so long he has given up all faults of speech. Instead he has expounded elaborately on the virtues of the listeners, the solitary buddhas, and all who teach the Dharma. He has copied the sūtras of the thus-gone ones, read them, recited them, and explained them to others. Regarding the teachings contained in them, he has been able to differentiate between the words and the meaning, and has been skilled in making others understand the same.

source: ལྗགས་ཡངས་པ་ཞེས་བྱའོ།
en: Therefore he is the One with a Well-Developed Tongue.

source: །ཡུན་རིང་པོ་ནས་ཕ་མ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། བླ་མ་དང་། སྦྱིན་གནས་ཀྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་བ་དང་། རབ་ཏུ་བྱུང་བ་ལ་ཕྱག་འཚལ་བ་དང་། གསོང་པོར་སྨྲ་བ་དང་། དབུ་སྐྲ་སྦེད་པ་དང་། སྟེང་དུ་སྤོས་ཀྱི་འབྲུ་མར་འཐོར་བ་དང་། སློང་བ་ཐམས་ཅད་ལ་ཕྱེ་མ་དང་། ཕྲེང་བ་བརྒྱུས་པ་དང་། མགོ་རྒྱན་སྦྱིན་པའི་ཕྱིར།
en: “For so long he has venerated parents, monks, priests, spiritual teachers, and worthy ones by putting his head to their feet. He has praised those who have gone forth and greeted them respectfully, shaved their hair, and anointed their heads with scented oils. To all the beggars he has offered colored powders, chaplets and garlands, and head ornaments.

source: དབུ་གཙུག་ཏོར་དང་ལྡན་ཞིང་སྤྱི་གཙུག་བལྟར་མི་མཐོང་བ་ཞེས་བྱའོ།
en: Therefore he is called the One with the Crown Extension, the Top of Whose Crown Cannot be Seen.

source: །ཡུན་རིང་པོ་ནས་གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་ཐམས་ཅད་བྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་དགེ་བ་ཡང་དག་པར་ལེན་དུ་འཛུད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་རྗེས་སུ་བསྟན་པ་དང་འགལ་བར་མི་བྱེད་པ་དང་། ཆོས་སྨྲ་བ་རྣམས་ཀྱིས་མངགས་ཏེ་ཕྱོགས་རྣམས་སུ་འགྲོ་བ་དང་འོངས་པས་ཡོངས་སུ་མི་སྐྱོ་བ་དང་། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། རང་སངས་རྒྱས་དང་། འཕགས་པ་ཉན་ཐོས་དང་། ཕ་མ་དང་། བླ་མ་དང་། སྦྱིན་གནས་ཐམས་ཅད་ལ་རིམ་གྲོ་བྱ་བར་སྤོས་སྣ་ཚོགས་ཀྱི་འབྲུ་མར་དང་། མར་དང་། སྒྲོན་མ་དང་། མར་མེ་རྣམས་ཀྱིས་མུན་པ་མུན་ནག་སེལ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ་མཛེས་པར་བྱེད་དུ་འཇུག་པ་དང་། འོ་མ་ལྟ་བུའི་མཛོད་སྤུས་བརྒྱན་པ་བྱེད་པ་དང་།
en: “For so long he has encouraged others to make liberal offerings of all sorts and admonished them to follow the teachings of all spiritual friends. Entrusted by those who teach the Dharma, he has gone in all directions without feeling weary in order to serve the buddhas, the bodhisattvas, the solitary buddhas, the noble listeners, Dharma teachers, parents, teachers, and all worthy ones. He has offered them lamps with scented oils of many kinds, and lights and lamps made with oil, ghee, or grass that dispel darkness. He has beautified the statues of the thus-gone ones with the most exquisite, pleasing things, and adorned them with heaps of milky-white jewels.

source: སེམས་ཅན་གཞན་བྱང་ཆུབ་ཀྱི་སེམས་མངོན་དུ་བྱེད་དུ་འཇུག་པས། དགེ་བའི་ཚོགས་ཁྱད་པར་དུ་གྱུར་པའི་ཕྱིར།
en: Because he has made others develop the mind of awakening, his accumulation of virtue has been exceptional.

source: སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་མཛེས་པར་སྐྱེས་ཤིང་། གཡས་སུ་འཁྱིལ་ལ་འབར་ཞིང་། ཁ་དོག་རྣམ་པར་དག་པ་སྣང་བ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: Therefore he is known as the One with the Beautiful, Glowing Tuft of Hair between the Eyebrows That Curls Clockwise and Has an Exquisite Color.

source: །སྲེད་མེད་ཀྱི་བུ་ཆེན་པོའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར། མཐུ་ཆེན་པོ་བརྙེས་པ་ཞེས་བྱའོ།
en: “Because he is endowed with the great strength of Nārāyaṇa, he is called the Great Nārāyaṇa.

source: །བདུད་བྱེ་བ་ཕྲག་བརྒྱ་ཐུལ་བའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར། སྲེད་མེད་ཀྱི་བུ་ཆེན་པོའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: Because he is endowed with power to tame many millions of demons, he is called the Destroyer of All Adversaries.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་ལྡན་པའི་ཕྱིར། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་འདུལ་བ་ཞེས་བྱའོ།
en: “Because he is endowed with the ten powers of the thus-gone ones, he is called the One with the Ten Powers of a Thus-Gone One.

source: །གནས་དང་གནས་མ་ཡིན་པ་མཁྱེན་པ་ལ་མཁས་པ་དང་། དམན་པ་ཉི་ཚེ་བའི་ཐེག་པ་རྣམ་པར་སྤོང་བ་དང་ཐེག་པ་ཆེན་པོའི་ཡོན་ཏན་ཡང་དག་པར་སྒྲུབ་པའི་སྟོབས་དང་ལྡན་པས།
en: “He is skilled in knowing what is proper and improper. He gives up the low and minor vehicle and possesses the power of accomplishing the qualities of the Great Vehicle.

source: སྟོབས་དེ་ལ་སྦྱོར་བ་ཆོག་མི་ཤེས་པའི་ཕྱིར།
en: He employs its inexhaustible power.

source: ད་ལྟར་བྱུང་བའི་ལས་ཡང་དག་པར་བླངས་པའི་རྒྱུ་དང་། རྣམ་པར་སྨིན་པ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར།
en: “He has the power that comes from knowing the cause and result of all actions in the past, present, and the future. Therefore he is the One with the Power That Comes from Knowing the Cause and Effect of All Actions in the Past, Present, and the Future.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་རིམ་པ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ལས་ཡང་དག་པར་བླངས་པའི་རྒྱུ་དང་། རྣམ་པར་སྨིན་པ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: “He has the power to know the capacities of all sentient beings and their levels of diligence. Therefore he is the One with the Power to Know the Capacities of All Sentient Beings and Their Levels of Diligence.

source: །ཁམས་དུ་མ་དང་། ཁམས་སྣ་ཚོགས་པའི་འཇིག་རྟེན་ལ་འཇུག་པ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་དང་བརྩོན་འགྲུས་ཀྱི་རིམ་པ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: “He has the power to know how one enters various types of worlds. Therefore he is the One with the Power to Know How One Enters Various Types of Worlds.

source: །མོས་པ་དུ་མ་དང་། མོས་པ་སྣ་ཚོགས་དང་། མོས་པ་མ་ལུས་པ་དང་། རྣམ་པར་གྲོལ་བ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར། ཁམས་དུ་མ་དང་། ཁམས་སྣ་ཚོགས་པའི་འཇིག་རྟེན་ལ་འཇུག་པ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: “He has the power to know what liberates various inclinations, many inclinations, and all inclinations. Therefore he is the One with the Power to Know What Liberates Various Inclinations, Many Inclinations, and All Inclinations.

source: །ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར། མོས་པ་དུ་མ་དང་། མོས་པ་སྣ་ཚོགས་དང་། མོས་པ་མ་ལུས་པ་ཐམས་ཅད་དང་། རྣམ་པར་གྲོལ་བ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: “He has the power to know the path that leads everywhere. Therefore he is the One with the Power to Know the Path That Leads Everywhere.

source: །བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། རྣམ་པར་གཞག་པ་ཐམས་ཅད་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར། ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “He has the power to know all contemplations, liberations, concentrations, and absorptions, as well as the way of purifying and stopping the disturbing emotions.

source: སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་མཁྱེན་པ་ཆགས་པ་མི་མངའ་བའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། རྣམ་པར་གཞག་པ་ཐམས་ཅད་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: Therefore he is the One with the Power to Know All Contemplations, Liberations, Concentrations, and Absorptions, as well as the Way of Purifying and Stopping the Disturbing Emotions. “He has the power to know all previous situations without attachment. Therefore he is the One with the Power to Know All Previous Situations without Attachment.

source: །གཟུགས་མ་ལུས་པ་ཐམས་ཅད་སྒྲིབ་པ་མེད་པར་གཟིགས་པའི་ལྷའི་སྤྱན་གྱི་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར། སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་དྲན་པ་མཁྱེན་པ་ཆགས་པ་མི་མངའ་བའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: “He has the power of knowledge stemming from his divine eye that sees clearly all forms without exception. Therefore he is the One with the Power of Knowledge Stemming from His Divine Eye That Sees Clearly All Forms without Exception.

source: །བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བར་གྱུར་པ་ཐམས་ཅད་དང་། ཟག་པ་ཐམས་ཅད་མ་ལུས་པར་ཟད་པ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར། གཟུགས་མ་ལུས་པ་ཐམས་ཅད་སྒྲིབ་པ་མེད་པར་གཟིགས་པའི་ལྷའི་སྤྱན་གྱིས་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: “He has the power to know how all habitual tendencies are formed and how all defiled states without exception are exhausted. Therefore he is the One with the Power to Know How All Habitual Tendencies Are Formed and How All Defiled States without Exception Are Exhausted.

source: །ཆོས་ཐམས་ཅད་མ་ལུས་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་དམ་བཅས་པ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་ཟིལ་གྱིས་མི་ནོན་པའི་དམ་བཅས་པའི་མི་འཇིགས་པ་བརྙེས་པའི་ཕྱིར། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བར་གྱུར་པ་ཐམས་ཅད་དང་། ཟག་པ་ཐམས་ཅད་མ་ལུས་པར་ཟད་པ་མཁྱེན་པའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “He has attained the confidence that results from his declaration of realizing all dharmas without exception, a confidence that outshines the entire world, including the realm of gods. Therefore he is the One Who Has Attained the Confidence That Results from His Declaration of Realizing All Dharmas without Exception, a Confidence That Outshines the Entire World, including the Realm of Gods.

source: ཀུན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་མྱ་ངན་ལས་འདས་པའི་བར་དུ་གཅོད་པའི་ཆོས་སུ་བསྟན་ཏེ། དེར་དམ་བཅས་པ་ལ། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་མི་ཤིགས་པའི་དམ་བཅས་པ་མི་འཇིགས་པ་བརྙེས་པའི་ཕྱིར།
en: “He declares, ‘All disturbing emotions are obstacles for passing beyond suffering,’ and thus discovers a confidence that the entire world, including the gods, cannot destroy.

source: ཆོས་ཐམས་ཅད་མ་ལུས་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་དམ་བཅས་པ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་ཟིལ་གྱིས་མི་ནོན་པའི་དམ་བཅས་པའི་མི་འཇིགས་པ་བརྙེས་པ་ཞེས་བྱའོ།
en: Therefore he is the One Who Declares ‘All disturbing emotions are obstacles for passing beyond suffering,’ and Thus Discovers a Confidence That the Entire World, including the Gods, Cannot Destroy.

source: །ངེས་པར་འབྱུང་བའི་ལམ་བསྒྲུབས་ན་མྱ་ངན་ལས་འདས་པ་རྙེད་པར་འགྱུར་རོ་ཞེས་དམ་བཅས་པ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་བརྒལ་དུ་མེད་པའི་དམ་བཅས་པའི་མི་འཇིགས་པ་བརྙེས་པའི་ཕྱིར།
en: “With his claim, ‘Passing beyond suffering is attained when the path of renunciation is accomplished,’ he has attained a fearlessness that the entire world, including its gods, cannot overturn.
